package gomoku;


public class Gomokunarabe {
	
	
	public static void main(String[] args) {
		
		//作成した配列に碁盤の目（・）を配列に格納しておく。ついでに縦横の説明も追加。
		String[][] goban = {	
				{ "　", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", " ←　横軸", },
				{ "0 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "1 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "2 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "3 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "4 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "5 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "6 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "7 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "8 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ "9 ", "・", "・", "・", "・", "・", "・", "・", "・", "・", "・", },
				{ " ↑　縦軸", },
		};
		
		String[] jiku = { "横", "縦" };	//軸　横縦
		String[] goishi = { "●", "○" };		//碁石(プレイヤー）

		
		System.out.print("五目並べゲームをはじめましょう(^^)/\n黒が先手、白が後手で交互に打ち、 縦、横、斜めのいずれかに先に碁石を5つを並べた方が勝ちです。\n\n");
		GamePlay.printGoban(goban);	//碁盤の表示

		
		//ゲームの実行
		GamePlay.setGoishi(goban,goishi,jiku);

		

		

	}

}
